sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
        /* Parameters update conditioned to ADC state:                            */
        /* Parameters that can be updated only when ADC is disabled:              */
        /*  - ADC clock mode                                                      */
        /*  - ADC clock prescaler                                                 */
        /*  - ADC resolution                                                      */
        if (ADC_IS_ENABLE(hadc) == RESET)
        {
            /* Some parameters of this register are not reset, since they are set   */
            /* by other functions and must be kept in case of usage of this         */
            /* function on the fly (update of a parameter of ADC_InitTypeDef        */
            /* without needing to reconfigure all other ADC groups/channels         */
            /* parameters):                                                         */
            /*   - internal measurement paths: Vbat, temperature sensor, Vref       */
            /*     (set into HAL_ADC_ConfigChannel() )                              */

            /* Configuration of ADC resolution                                      */
            MODIFY_REG(hadc->Instance->CFGR1,
                       ADC_CFGR1_RESSEL,
                       hadc->Init.Resolution );

            /* Configuration of ADC clock mode: clock source AHB or HSI with        */
            /* selectable prescaler                                                 */
            MODIFY_REG(hadc->Instance->CFGR2,
                       ADC_CFGR2_CKMODE,
                       hadc->Init.ClockPrescaler );
        }

        /* Configuration of ADC:                                                  */
        /*  - discontinuous mode                                                  */
        /*  - LowPowerAutoWait mode                                               */
        /*  - LowPowerAutoPowerOff mode                                           */
        /*  - continuous conversion mode                                          */
        /*  - overrun                                                             */
        /*  - external trigger to start conversion                                */
        /*  - external trigger polarity                                           */
        /*  - data alignment                                                      */
        /*  - resolution                                                          */
        /*  - scan direction                                                      */
        /*  - DMA continuous request                                              */
//    hadc->Instance->CFGR1 &= ~( ADC_CFGR1_DISCEN  |
//                                ADC_CFGR1_AUTOFF  |
//                                ADC_CFGR1_AUTDLY  |
//                                ADC_CFGR1_CONT    |
//                                ADC_CFGR1_OVRMOD  |
//                                ADC_CFGR1_EXTSEL  |
//                                ADC_CFGR1_EXTEN   |
//                                ADC_CFGR1_ALIGN   |
//                                ADC_CFGR1_SCANDIR |
//                                ADC_CFGR1_DMACFG   );
        hadc->Instance->CFGR1 &= ~( ADC_CFGR1_DISCEN  |
                                    ADC_CFGR1_CONT    |
                                    ADC_CFGR1_OVRMOD  |
                                    ADC_CFGR1_EXTSEL  |
                                    ADC_CFGR1_EXTEN   |
                                    ADC_CFGR1_ALIGN   |
                                    ADC_CFGR1_SCANDIR |
                                    ADC_CFGR1_DMACFG   );

        tmpCFGR1 |= (ADC_CFGR1_AUTOWAIT((uint32_t)hadc->Init.LowPowerAutoWait)        |
                     ADC_CFGR1_AUTOOFF((uint32_t)hadc->Init.LowPowerAutoPowerOff)     |
                     ADC_CFGR1_CONTINUOUS((uint32_t)hadc->Init.ContinuousConvMode)    |
                     ADC_CFGR1_OVERRUN(hadc->Init.Overrun)                            |
                     hadc->Init.DataAlign                                             |
                     ADC_SCANDIR(hadc->Init.ScanConvMode)                             |
                     ADC_CFGR1_DMACONTREQ((uint32_t)hadc->Init.DMAContinuousRequests)  );

        /* Enable discontinuous mode only if continuous mode is disabled */
        if (hadc->Init.DiscontinuousConvMode == ENABLE)
        {
            if (hadc->Init.ContinuousConvMode == DISABLE)
            {
                /* Enable the selected ADC group regular discontinuous mode */
                tmpCFGR1 |= ADC_CFGR1_DISCEN;
            }
            else
            {
                /* ADC regular group discontinuous was intended to be enabled,        */
                /* but ADC regular group modes continuous and sequencer discontinuous */
                /* cannot be enabled simultaneously.                                  */

                /* Update ADC state machine to error */
                SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

                /* Set ADC error code to ADC IP internal error */
                SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);
            }
        }

        /* Enable external trigger if trigger selection is different of software  */
        /* start.                                                                 */
        /* Note: This configuration keeps the hardware feature of parameter       */
        /*       ExternalTrigConvEdge "trigger edge none" equivalent to           */
        /*       software start.                                                  */
        if (hadc->Init.ExternalTrigConv != ADC_SOFTWARE_START)
        {
            tmpCFGR1 |= ( hadc->Init.ExternalTrigConv    |
                          hadc->Init.ExternalTrigConvEdge );
        }

        /* Update ADC configuration register with previous settings */
        hadc->Instance->CFGR1 |= tmpCFGR1;

        /* Channel sampling time configuration */
        /* Management of parameters "SamplingTimeCommon" and "SamplingTime"       */
        /* (obsolete): sampling time set in this function if parameter            */
        /*  "SamplingTimeCommon" has been set to a valid sampling time.           */
        /* Otherwise, sampling time is set into ADC channel initialization        */
        /* structure with parameter "SamplingTime" (obsolete).                    */
        if (IS_ADC_SAMPLE_TIME(hadc->Init.SamplingTimeCommon))
        {
            /* Channel sampling time configuration */
            /* Clear the old sample time */
            hadc->Instance->SMPR &= ~(ADC_SMPR_SMP);

