sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
            /* Set the new sample time */
            hadc->Instance->SMPR |= ADC_SMPR_SET(hadc->Init.SamplingTimeCommon);
        }

        /* Check back that ADC registers have effectively been configured to      */
        /* ensure of no potential problem of ADC core IP clocking.                */
        /* Check through register CFGR1 (excluding analog watchdog configuration: */
        /* set into separate dedicated function, and bits of ADC resolution set   */
        /* out of temporary variable 'tmpCFGR1').                                 */
        if ((hadc->Instance->CFGR1 & ~(ADC_CFGR1_AWDCH | ADC_CFGR1_AWDEN | ADC_CFGR1_AWDSGL | ADC_CFGR1_RESSEL))
                == tmpCFGR1)
        {
            /* Set ADC error code to none */
            ADC_CLEAR_ERRORCODE(hadc);

            /* Set the ADC state */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_BUSY_INTERNAL,
                              HAL_ADC_STATE_READY);
        }
        else
        {
            /* Update ADC state machine to error */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_BUSY_INTERNAL,
                              HAL_ADC_STATE_ERROR_INTERNAL);

            /* Set ADC error code to ADC IP internal error */
            SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);

            tmp_hal_status = HAL_ERROR;
        }

    }
    else
    {
        /* Update ADC state machine to error */
        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

        tmp_hal_status = HAL_ERROR;
    }

    /* Return function status */
    return tmp_hal_status;
}


/**
  * @brief  Deinitialize the ADC peripheral registers to their default reset
  *         values, with deinitialization of the ADC MSP.
  * @note   For devices with several ADCs: reset of ADC common registers is done
  *         only if all ADCs sharing the same common group are disabled.
  *         If this is not the case, reset of these common parameters reset is
  *         bypassed without error reporting: it can be the intended behaviour in
  *         case of reset of a single ADC while the other ADCs sharing the same
  *         common group is still running.
  * @param  hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_DeInit(ADC_HandleTypeDef* hadc)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check ADC handle */
    if(hadc == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Set ADC state */
    SET_BIT(hadc->State, HAL_ADC_STATE_BUSY_INTERNAL);

    /* Stop potential conversion on going, on regular group */
    tmp_hal_status = ADC_ConversionStop(hadc);

    /* Disable ADC peripheral if conversions are effectively stopped */
    if (tmp_hal_status == HAL_OK)
    {
        /* Disable the ADC peripheral */
        tmp_hal_status = ADC_Disable(hadc);

        /* Check if ADC is effectively disabled */
        if (tmp_hal_status != HAL_ERROR)
        {
            /* Change ADC state */
            hadc->State = HAL_ADC_STATE_READY;
        }
    }


    /* Configuration of ADC parameters if previous preliminary actions are      */
    /* correctly completed.                                                     */
    if (tmp_hal_status != HAL_ERROR)
    {

        /* ========== Reset ADC registers ========== */
        /* Reset register IER */
        __HAL_ADC_DISABLE_IT(hadc, (ADC_IT_AWD   | ADC_IT_OVR  |
                                    ADC_IT_EOS   | ADC_IT_EOC  |
                                    ADC_IT_EOSMP /*| ADC_IT_RDY*/   ) );

        /* Reset register ISR */
        __HAL_ADC_CLEAR_FLAG(hadc, (ADC_FLAG_AWD   | ADC_FLAG_OVR  |
                                    ADC_FLAG_EOS   | ADC_FLAG_EOC  |
                                    ADC_FLAG_EOSMP /*| ADC_FLAG_RDY*/   ) );

        /* Reset register CR */
        /* Bits ADC_CR_ADCAL, ADC_CR_ADSTP, ADC_CR_ADSTART are in access mode     */
        /* "read-set": no direct reset applicable.                                */

        /* Reset register CFGR1 */
        hadc->Instance->CFGR1 &= ~(ADC_CFGR1_AWDCH   | ADC_CFGR1_AWDEN  | ADC_CFGR1_AWDSGL | ADC_CFGR1_DISCEN |
                                   /*ADC_CFGR1_AUTOFF  |*/ ADC_CFGR1_WAIT   | ADC_CFGR1_CONT   | ADC_CFGR1_OVRMOD |
                                   ADC_CFGR1_EXTEN   | ADC_CFGR1_EXTSEL | ADC_CFGR1_ALIGN  | ADC_CFGR1_RESSEL    |
                                   ADC_CFGR1_SCANDIR | ADC_CFGR1_DMACFG | ADC_CFGR1_DMAEN                      );

        /* Reset register CFGR2 */
        /* Note: Update of ADC clock mode is conditioned to ADC state disabled:   */
        /*       already done above.                                              */
        hadc->Instance->CFGR2 &= ~ADC_CFGR2_CKMODE;

        /* Reset register SMPR */
        hadc->Instance->SMPR &= ~ADC_SMPR_SMP;

        /* Reset register TR1 */
        hadc->Instance->TR &= ~(ADC_TR_HT | ADC_TR_LT);

        /* Reset register CHSELR */
//    hadc->Instance->CHSELR &= ~(ADC_CHSELR_CHSEL18 | ADC_CHSELR_CHSEL17 | ADC_CHSELR_CHSEL16 |
//                                ADC_CHSELR_CHSEL15 | ADC_CHSELR_CHSEL14 | ADC_CHSELR_CHSEL13 | ADC_CHSELR_CHSEL12 |
//                                ADC_CHSELR_CHSEL11 | ADC_CHSELR_CHSEL10 | ADC_CHSELR_CHSEL9  | ADC_CHSELR_CHSEL8  |
//                                ADC_CHSELR_CHSEL7  | ADC_CHSELR_CHSEL6  | ADC_CHSELR_CHSEL5  | ADC_CHSELR_CHSEL4  |
//                                ADC_CHSELR_CHSEL3  | ADC_CHSELR_CHSEL2  | ADC_CHSELR_CHSEL1  | ADC_CHSELR_CHSEL0   );
        hadc->Instance->CHSELR &= ~(ADC_CHSELR_CHSEL12 |
                                    ADC_CHSELR_CHSEL11 | ADC_CHSELR_CHSEL9  | ADC_CHSELR_CHSEL8  |
                                    ADC_CHSELR_CHSEL7  | ADC_CHSELR_CHSEL6  | ADC_CHSELR_CHSEL5  | ADC_CHSELR_CHSEL4  |
                                    ADC_CHSELR_CHSEL3  | ADC_CHSELR_CHSEL2  | ADC_CHSELR_CHSEL1  | ADC_CHSELR_CHSEL0   );

        /* Reset register DR */
        /* bits in access mode read only, no direct reset applicable*/

        /* Reset register CCR */
        ADC->CCR &= ~(ADC_CCR_ALL);

        /* ========== Hard reset ADC peripheral ========== */
        /* Performs a global reset of the entire ADC peripheral: ADC state is     */
        /* forced to a similar state after device power-on.                       */
        /* If needed, copy-paste and uncomment the following reset code into      */
        /* function "void HAL_ADC_MspInit(ADC_HandleTypeDef* hadc)":              */
        /*                                                                        */
        /*  __HAL_RCC_ADC1_FORCE_RESET()                                                  */
        /*  __HAL_RCC_ADC1_RELEASE_RESET()                                                */

