sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
        if (hadc->MspDeInitCallback == NULL)
        {
            hadc->MspDeInitCallback = HAL_ADC_MspDeInit; /* Legacy weak MspDeInit  */
        }

        /* DeInit the low level hardware */
        hadc->MspDeInitCallback(hadc);
#else
        /* DeInit the low level hardware */
        HAL_ADC_MspDeInit(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

        /* Set ADC error code to none */
        ADC_CLEAR_ERRORCODE(hadc);

        /* Set ADC state */
        hadc->State = HAL_ADC_STATE_RESET;
    }

    /* Process unlocked */
    __HAL_UNLOCK(hadc);

    /* Return function status */
    return tmp_hal_status;
}


/**
  * @brief  Initializes the ADC MSP.
  * @param  hadc ADC handle
  * @retval None
  */
__weak void HAL_ADC_MspInit(ADC_HandleTypeDef* hadc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hadc);

    /* NOTE : This function should not be modified. When the callback is needed,
              function HAL_ADC_MspInit must be implemented in the user file.
     */
}

/**
  * @brief  DeInitializes the ADC MSP.
  * @param  hadc ADC handle
  * @retval None
  */
__weak void HAL_ADC_MspDeInit(ADC_HandleTypeDef* hadc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hadc);

    /* NOTE : This function should not be modified. When the callback is needed,
              function HAL_ADC_MspDeInit must be implemented in the user file.
     */
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User ADC Callback
  *         To be used instead of the weak predefined callback
  * @param  hadc Pointer to a ADC_HandleTypeDef structure that contains
  *                the configuration information for the specified ADC.
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_ADC_CONVERSION_COMPLETE_CB_ID      ADC conversion complete callback ID
  *          @arg @ref HAL_ADC_CONVERSION_HALF_CB_ID          ADC conversion complete callback ID
  *          @arg @ref HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID    ADC analog watchdog 1 callback ID
  *          @arg @ref HAL_ADC_ERROR_CB_ID                    ADC error callback ID
  *          @arg @ref HAL_ADC_INJ_CONVERSION_COMPLETE_CB_ID  ADC group injected conversion complete callback ID
  *          @arg @ref HAL_ADC_MSPINIT_CB_ID                  ADC Msp Init callback ID
  *          @arg @ref HAL_ADC_MSPDEINIT_CB_ID                ADC Msp DeInit callback ID
  *          @arg @ref HAL_ADC_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_ADC_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_RegisterCallback(ADC_HandleTypeDef *hadc, HAL_ADC_CallbackIDTypeDef CallbackID, pADC_CallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

        return HAL_ERROR;
    }

    if ((hadc->State & HAL_ADC_STATE_READY) != 0)
    {
        switch (CallbackID)
        {
        case HAL_ADC_CONVERSION_COMPLETE_CB_ID :
            hadc->ConvCpltCallback = pCallback;
            break;

        case HAL_ADC_CONVERSION_HALF_CB_ID :
            hadc->ConvHalfCpltCallback = pCallback;
            break;

        case HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID :
            hadc->LevelOutOfWindowCallback = pCallback;
            break;

        case HAL_ADC_ERROR_CB_ID :
            hadc->ErrorCallback = pCallback;
            break;

        case HAL_ADC_MSPINIT_CB_ID :
            hadc->MspInitCallback = pCallback;
            break;

        case HAL_ADC_MSPDEINIT_CB_ID :
            hadc->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    }
    else if (HAL_ADC_STATE_RESET == hadc->State)
    {
        switch (CallbackID)
        {
        case HAL_ADC_MSPINIT_CB_ID :
            hadc->MspInitCallback = pCallback;
            break;

        case HAL_ADC_MSPDEINIT_CB_ID :
            hadc->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    return status;
}

/**
  * @brief  Unregister a ADC Callback
  *         ADC callback is redirected to the weak predefined callback
  * @param  hadc Pointer to a ADC_HandleTypeDef structure that contains
  *                the configuration information for the specified ADC.
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_ADC_CONVERSION_COMPLETE_CB_ID      ADC conversion complete callback ID
  *          @arg @ref HAL_ADC_CONVERSION_HALF_CB_ID          ADC conversion complete callback ID
  *          @arg @ref HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID    ADC analog watchdog 1 callback ID
  *          @arg @ref HAL_ADC_ERROR_CB_ID                    ADC error callback ID
  *          @arg @ref HAL_ADC_INJ_CONVERSION_COMPLETE_CB_ID  ADC group injected conversion complete callback ID
  *          @arg @ref HAL_ADC_MSPINIT_CB_ID                  ADC Msp Init callback ID
  *          @arg @ref HAL_ADC_MSPDEINIT_CB_ID                ADC Msp DeInit callback ID
  *          @arg @ref HAL_ADC_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_ADC_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_UnRegisterCallback(ADC_HandleTypeDef *hadc, HAL_ADC_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    if ((hadc->State & HAL_ADC_STATE_READY) != 0)
    {
        switch (CallbackID)
        {
        case HAL_ADC_CONVERSION_COMPLETE_CB_ID :
            hadc->ConvCpltCallback = HAL_ADC_ConvCpltCallback;
            break;

        case HAL_ADC_CONVERSION_HALF_CB_ID :
            hadc->ConvHalfCpltCallback = HAL_ADC_ConvHalfCpltCallback;
            break;

