sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
        case HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID :
            hadc->LevelOutOfWindowCallback = HAL_ADC_LevelOutOfWindowCallback;
            break;

        case HAL_ADC_ERROR_CB_ID :
            hadc->ErrorCallback = HAL_ADC_ErrorCallback;
            break;

        case HAL_ADC_MSPINIT_CB_ID :
            hadc->MspInitCallback = HAL_ADC_MspInit; /* Legacy weak MspInit              */
            break;

        case HAL_ADC_MSPDEINIT_CB_ID :
            hadc->MspDeInitCallback = HAL_ADC_MspDeInit; /* Legacy weak MspDeInit            */
            break;

        default :
            /* Update the error code */
            hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (HAL_ADC_STATE_RESET == hadc->State)
    {
        switch (CallbackID)
        {
        case HAL_ADC_MSPINIT_CB_ID :
            hadc->MspInitCallback = HAL_ADC_MspInit;                   /* Legacy weak MspInit              */
            break;

        case HAL_ADC_MSPDEINIT_CB_ID :
            hadc->MspDeInitCallback = HAL_ADC_MspDeInit;               /* Legacy weak MspDeInit            */
            break;

        default :
            /* Update the error code */
            hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        hadc->ErrorCode |= HAL_ADC_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    return status;
}

#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group2 IO operation functions
 *  @brief    IO operation functions
 *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Start conversion of regular group.
      (+) Stop conversion of regular group.
      (+) Poll for conversion complete on regular group.
      (+) Poll for conversion event.
      (+) Get result of regular channel conversion.
      (+) Start conversion of regular group and enable interruptions.
      (+) Stop conversion of regular group and disable interruptions.
      (+) Handle ADC interrupt request
      (+) Start conversion of regular group and enable DMA transfer.
      (+) Stop conversion of regular group and disable ADC DMA transfer.
@endverbatim
  * @{
  */

/**
  * @brief  Enables ADC, starts conversion of regular group.
  *         Interruptions enabled in this function: None.
  * @param  hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_Start(ADC_HandleTypeDef* hadc)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Perform ADC enable and conversion start if no conversion is on going */
    if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
    {
        /* Process locked */
        __HAL_LOCK(hadc);

        /* Enable the ADC peripheral */
        /* If low power mode AutoPowerOff is enabled, power-on/off phases are     */
        /* performed automatically by hardware.                                   */
        if (hadc->Init.LowPowerAutoPowerOff != ENABLE)
        {
            tmp_hal_status = ADC_Enable(hadc);
        }

        /* Start conversion if ADC is effectively enabled */
        if (tmp_hal_status == HAL_OK)
        {
            /* Set ADC state                                                        */
            /* - Clear state bitfield related to regular group conversion results   */
            /* - Set state bitfield related to regular operation                    */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_READY | HAL_ADC_STATE_REG_EOC | HAL_ADC_STATE_REG_OVR | HAL_ADC_STATE_REG_EOSMP,
                              HAL_ADC_STATE_REG_BUSY);

            /* Reset ADC all error code fields */
            ADC_CLEAR_ERRORCODE(hadc);

            /* Process unlocked */
            /* Unlock before starting ADC conversions: in case of potential         */
            /* interruption, to let the process to ADC IRQ Handler.                 */
            __HAL_UNLOCK(hadc);

            /* Clear regular group conversion flag and overrun flag */
            /* (To ensure of no unknown state from potential previous ADC           */
            /* operations)                                                          */
            __HAL_ADC_CLEAR_FLAG(hadc, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));

            /* Enable conversion of regular group.                                  */
            /* If software start has been selected, conversion starts immediately.  */
            /* If external trigger has been selected, conversion will start at next */
            /* trigger event.                                                       */
            hadc->Instance->CR |= ADC_CR_ADSTART;
        }
    }
    else
    {
        tmp_hal_status = HAL_BUSY;
    }

    /* Return function status */
    return tmp_hal_status;
}

/**
  * @brief  Stop ADC conversion of regular group, disable ADC peripheral.
  * @param  hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_ADC_Stop(ADC_HandleTypeDef* hadc)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Process locked */
    __HAL_LOCK(hadc);

    /* 1. Stop potential conversion on going, on regular group */
    tmp_hal_status = ADC_ConversionStop(hadc);

    /* Disable ADC peripheral if conversions are effectively stopped */
    if (tmp_hal_status == HAL_OK)
    {
        /* 2. Disable the ADC peripheral */
        tmp_hal_status = ADC_Disable(hadc);

        /* Check if ADC is effectively disabled */
        if (tmp_hal_status == HAL_OK)
        {
            /* Set ADC state */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_REG_BUSY,
                              HAL_ADC_STATE_READY);
        }
    }

