sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
                /* Process unlocked */
                __HAL_UNLOCK(hadc);

                return HAL_TIMEOUT;
            }
        }
    }

    switch(EventType)
    {
    /* Analog watchdog (level out of window) event */
    case ADC_AWD_EVENT:
        /* Set ADC state */
        SET_BIT(hadc->State, HAL_ADC_STATE_AWD1);

        /* Clear ADC analog watchdog flag */
        __HAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_AWD);
        break;

    /* Overrun event */
    default: /* Case ADC_OVR_EVENT */
        /* If overrun is set to overwrite previous data, overrun event is not     */
        /* considered as an error.                                                */
        /* (cf ref manual "Managing conversions without using the DMA and without */
        /* overrun ")                                                             */
        if (hadc->Init.Overrun == ADC_OVR_DATA_PRESERVED)
        {
            /* Set ADC state */
            SET_BIT(hadc->State, HAL_ADC_STATE_REG_OVR);

            /* Set ADC error code to overrun */
            SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_OVR);
        }

        /* Clear ADC Overrun flag */
        __HAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_OVR);
        break;
    }

    /* Return ADC state */
    return HAL_OK;
}

/**
  * @brief  Enables ADC, starts conversion of regular group with interruption.
  *         Interruptions enabled in this function:
  *          - EOC (end of conversion of regular group) or EOS (end of
  *            sequence of regular group) depending on ADC initialization
  *            parameter "EOCSelection"
  *          - overrun (if available)
  *         Each of these interruptions has its dedicated callback function.
  * @param  hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_Start_IT(ADC_HandleTypeDef* hadc)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Perform ADC enable and conversion start if no conversion is on going */
    if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
    {
        /* Process locked */
        __HAL_LOCK(hadc);

        /* Enable the ADC peripheral */
        /* If low power mode AutoPowerOff is enabled, power-on/off phases are     */
        /* performed automatically by hardware.                                   */
        if (hadc->Init.LowPowerAutoPowerOff != ENABLE)
        {
            tmp_hal_status = ADC_Enable(hadc);
        }

        /* Start conversion if ADC is effectively enabled */
        if (tmp_hal_status == HAL_OK)
        {
            /* Set ADC state                                                        */
            /* - Clear state bitfield related to regular group conversion results   */
            /* - Set state bitfield related to regular operation                    */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_READY | HAL_ADC_STATE_REG_EOC | HAL_ADC_STATE_REG_OVR | HAL_ADC_STATE_REG_EOSMP,
                              HAL_ADC_STATE_REG_BUSY);

            /* Reset ADC all error code fields */
            ADC_CLEAR_ERRORCODE(hadc);

            /* Process unlocked */
            /* Unlock before starting ADC conversions: in case of potential         */
            /* interruption, to let the process to ADC IRQ Handler.                 */
            __HAL_UNLOCK(hadc);

            /* Clear regular group conversion flag and overrun flag */
            /* (To ensure of no unknown state from potential previous ADC           */
            /* operations)                                                          */
            __HAL_ADC_CLEAR_FLAG(hadc, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));

            /* Enable ADC end of conversion interrupt */
            /* Enable ADC overrun interrupt */
            switch(hadc->Init.EOCSelection)
            {
            case ADC_EOC_SEQ_CONV:
                __HAL_ADC_DISABLE_IT(hadc, ADC_IT_EOC);
                __HAL_ADC_ENABLE_IT(hadc, (ADC_IT_EOS | ADC_IT_OVR));
                break;
            /* case ADC_EOC_SINGLE_CONV */
            default:
                __HAL_ADC_ENABLE_IT(hadc, (ADC_IT_EOC | ADC_IT_EOS | ADC_IT_OVR));
                break;
            }

            /* Enable conversion of regular group.                                  */
            /* If software start has been selected, conversion starts immediately.  */
            /* If external trigger has been selected, conversion will start at next */
            /* trigger event.                                                       */
            hadc->Instance->CR |= ADC_CR_ADSTART;
        }
    }
    else
    {
        tmp_hal_status = HAL_BUSY;
    }

    /* Return function status */
    return tmp_hal_status;
}


/**
  * @brief  Stop ADC conversion of regular group, disable interruption of
  *         end-of-conversion, disable ADC peripheral.
  * @param  hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_ADC_Stop_IT(ADC_HandleTypeDef* hadc)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Process locked */
    __HAL_LOCK(hadc);

    /* 1. Stop potential conversion on going, on regular group */
    tmp_hal_status = ADC_ConversionStop(hadc);

    /* Disable ADC peripheral if conversions are effectively stopped */
    if (tmp_hal_status == HAL_OK)
    {
        /* Disable ADC end of conversion interrupt for regular group */
        /* Disable ADC overrun interrupt */
        __HAL_ADC_DISABLE_IT(hadc, (ADC_IT_EOC | ADC_IT_EOS | ADC_IT_OVR));

        /* 2. Disable the ADC peripheral */
        tmp_hal_status = ADC_Disable(hadc);

        /* Check if ADC is effectively disabled */
        if (tmp_hal_status == HAL_OK)
        {
            /* Set ADC state */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_REG_BUSY,
                              HAL_ADC_STATE_READY);
        }
    }

