sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
    /* Process unlocked */
    __HAL_UNLOCK(hadc);

    /* Return function status */
    return tmp_hal_status;
}

/**
  * @brief  Enables ADC, starts conversion of regular group and transfers result
  *         through DMA.
  *         Interruptions enabled in this function:
  *          - DMA transfer complete
  *          - DMA half transfer
  *          - overrun
  *         Each of these interruptions has its dedicated callback function.
  * @param  hadc ADC handle
  * @param  pData The destination Buffer address.
  * @param  Length The length of data to be transferred from ADC peripheral to memory.
  * @retval None
  */
HAL_StatusTypeDef HAL_ADC_Start_DMA(ADC_HandleTypeDef* hadc, uint32_t* pData, uint32_t Length)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Perform ADC enable and conversion start if no conversion is on going */
    if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
    {
        /* Process locked */
        __HAL_LOCK(hadc);

        /* Enable the ADC peripheral */
        /* If low power mode AutoPowerOff is enabled, power-on/off phases are       */
        /* performed automatically by hardware.                                     */
        if (hadc->Init.LowPowerAutoPowerOff != ENABLE)
        {
            tmp_hal_status = ADC_Enable(hadc);
        }

        /* Start conversion if ADC is effectively enabled */
        if (tmp_hal_status == HAL_OK)
        {
            /* Set ADC state                                                        */
            /* - Clear state bitfield related to regular group conversion results   */
            /* - Set state bitfield related to regular operation                    */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_READY | HAL_ADC_STATE_REG_EOC | HAL_ADC_STATE_REG_OVR | HAL_ADC_STATE_REG_EOSMP,
                              HAL_ADC_STATE_REG_BUSY);

            /* Reset ADC all error code fields */
            ADC_CLEAR_ERRORCODE(hadc);

            /* Process unlocked */
            /* Unlock before starting ADC conversions: in case of potential         */
            /* interruption, to let the process to ADC IRQ Handler.                 */
            __HAL_UNLOCK(hadc);

            /* Set the DMA transfer complete callback */
            hadc->DMA_Handle->XferCpltCallback = ADC_DMAConvCplt;

            /* Set the DMA half transfer complete callback */
            hadc->DMA_Handle->XferHalfCpltCallback = ADC_DMAHalfConvCplt;

            /* Set the DMA error callback */
            hadc->DMA_Handle->XferErrorCallback = ADC_DMAError;


            /* Manage ADC and DMA start: ADC overrun interruption, DMA start, ADC   */
            /* start (in case of SW start):                                         */

            /* Clear regular group conversion flag and overrun flag */
            /* (To ensure of no unknown state from potential previous ADC           */
            /* operations)                                                          */
            __HAL_ADC_CLEAR_FLAG(hadc, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));

            /* Enable ADC overrun interrupt */
            __HAL_ADC_ENABLE_IT(hadc, ADC_IT_OVR);

            /* Enable ADC DMA mode */
            hadc->Instance->CFGR1 |= ADC_CFGR1_DMAEN;

            /* Start the DMA channel */
            HAL_DMA_Start_IT(hadc->DMA_Handle, (uint32_t)&hadc->Instance->DR, (uint32_t)pData, Length);

            /* Enable conversion of regular group.                                  */
            /* If software start has been selected, conversion starts immediately.  */
            /* If external trigger has been selected, conversion will start at next */
            /* trigger event.                                                       */
            hadc->Instance->CR |= ADC_CR_ADSTART;
        }
    }
    else
    {
        tmp_hal_status = HAL_BUSY;
    }

    /* Return function status */
    return tmp_hal_status;
}

/**
  * @brief  Stop ADC conversion of regular group, disable ADC DMA transfer, disable
  *         ADC peripheral.
  *         Each of these interruptions has its dedicated callback function.
  * @param  hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_ADC_Stop_DMA(ADC_HandleTypeDef* hadc)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Process locked */
    __HAL_LOCK(hadc);

    /* 1. Stop potential conversion on going, on regular group */
    tmp_hal_status = ADC_ConversionStop(hadc);

    /* Disable ADC peripheral if conversions are effectively stopped */
    if (tmp_hal_status == HAL_OK)
    {
        /* Disable ADC DMA (ADC DMA configuration ADC_CFGR_DMACFG is kept) */
        hadc->Instance->CFGR1 &= ~ADC_CFGR1_DMAEN;

        /* Disable the DMA channel (in case of DMA in circular mode or stop while */
        /* while DMA transfer is on going)                                        */
        tmp_hal_status = HAL_DMA_Abort(hadc->DMA_Handle);

        /* Check if DMA channel effectively disabled */
        if (tmp_hal_status != HAL_OK)
        {
            /* Update ADC state machine to error */
            SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_DMA);
        }

        /* Disable ADC overrun interrupt */
        __HAL_ADC_DISABLE_IT(hadc, ADC_IT_OVR);

        /* 2. Disable the ADC peripheral */
        /* Update "tmp_hal_status" only if DMA channel disabling passed, to keep  */
        /* in memory a potential failing status.                                  */
        if (tmp_hal_status == HAL_OK)
        {
            tmp_hal_status = ADC_Disable(hadc);
        }
        else
        {
            ADC_Disable(hadc);
        }

        /* Check if ADC is effectively disabled */
        if (tmp_hal_status == HAL_OK)
        {
            /* Set ADC state */
            ADC_STATE_CLR_SET(hadc->State,
                              HAL_ADC_STATE_REG_BUSY,
                              HAL_ADC_STATE_READY);
        }

