sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
            hadc->ErrorCallback(hadc);
#else
            HAL_ADC_ErrorCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
        }

        /* Clear the Overrun flag */
        __HAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_OVR);
    }

}


/**
  * @brief  Conversion complete callback in non blocking mode
  * @param  hadc ADC handle
  * @retval None
  */
__weak void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hadc);

    /* NOTE : This function should not be modified. When the callback is needed,
              function HAL_ADC_ConvCpltCallback must be implemented in the user file.
     */
}

/**
  * @brief  Conversion DMA half-transfer callback in non blocking mode
  * @param  hadc ADC handle
  * @retval None
  */
__weak void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hadc);

    /* NOTE : This function should not be modified. When the callback is needed,
              function HAL_ADC_ConvHalfCpltCallback must be implemented in the user file.
    */
}

/**
  * @brief  Analog watchdog callback in non blocking mode.
  * @param  hadc ADC handle
  * @retval None
  */
__weak void HAL_ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef* hadc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hadc);

    /* NOTE : This function should not be modified. When the callback is needed,
              function HAL_ADC_LevelOoutOfWindowCallback must be implemented in the user file.
    */
}

/**
  * @brief  ADC error callback in non blocking mode
  *        (ADC conversion with interruption or transfer by DMA)
  * @param  hadc ADC handle
  * @retval None
  */
__weak void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hadc);

    /* NOTE : This function should not be modified. When the callback is needed,
              function HAL_ADC_ErrorCallback must be implemented in the user file.
    */
}


/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group3 Peripheral Control functions
 *  @brief    Peripheral Control functions
 *
@verbatim
 ===============================================================================
             ##### Peripheral Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure channels on regular group
      (+) Configure the analog watchdog

@endverbatim
  * @{
  */

/**
  * @brief  Configures the the selected channel to be linked to the regular
  *         group.
  * @note   In case of usage of internal measurement channels:
  *         VrefInt/Vbat/TempSensor.
  *         Sampling time constraints must be respected (sampling time can be
  *         adjusted in function of ADC clock frequency and sampling time
  *         setting).
  *         Refer to device datasheet for timings values, parameters TS_vrefint,
  *         TS_vbat, TS_temp (values rough order: 5us to 17us).
  *         These internal paths can be be disabled using function
  *         HAL_ADC_DeInit().
  * @note   Possibility to update parameters on the fly:
  *         This function initializes channel into regular group, following
  *         calls to this function can be used to reconfigure some parameters
  *         of structure "ADC_ChannelConfTypeDef" on the fly, without reseting
  *         the ADC.
  *         The setting of these parameters is conditioned to ADC state.
  *         For parameters constraints, see comments of structure
  *         "ADC_ChannelConfTypeDef".
  * @param  hadc ADC handle
  * @param  sConfig Structure of ADC channel for regular group.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_ConfigChannel(ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* sConfig)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;
    __IO uint32_t wait_loop_index = 0U;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
    assert_param(IS_ADC_CHANNEL(sConfig->Channel));
    assert_param(IS_ADC_RANK(sConfig->Rank));

    if (! IS_ADC_SAMPLE_TIME(hadc->Init.SamplingTimeCommon))
    {
        assert_param(IS_ADC_SAMPLE_TIME(sConfig->SamplingTime));
    }

    /* Process locked */
    __HAL_LOCK(hadc);

    /* Parameters update conditioned to ADC state:                              */
    /* Parameters that can be updated when ADC is disabled or enabled without   */
    /* conversion on going on regular group:                                    */
    /*  - Channel number                                                        */
    /*  - Channel sampling time                                                 */
    /*  - Management of internal measurement channels: VrefInt/TempSensor/Vbat  */
    if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
    {
        /* Configure channel: depending on rank setting, add it or remove it from */
        /* ADC conversion sequencer.                                              */
        if (sConfig->Rank != ADC_RANK_NONE)
        {
            /* Regular sequence configuration */
            /* Set the channel selection register from the selected channel */
            hadc->Instance->CHSELR |= ADC_CHSELR_CHANNEL(sConfig->Channel);

            /* Channel sampling time configuration */
            /* Management of parameters "SamplingTimeCommon" and "SamplingTime"     */
            /* (obsolete): sampling time set in this function with                  */
            /* parameter "SamplingTime" (obsolete) only if not already set into     */
            /* ADC initialization structure with parameter "SamplingTimeCommon".    */
            if (! IS_ADC_SAMPLE_TIME(hadc->Init.SamplingTimeCommon))
            {
                /* Modify sampling time if needed (not needed in case of reoccurrence */
                /* for several channels programmed consecutively into the sequencer)  */
                if (sConfig->SamplingTime != ADC_GET_SAMPLINGTIME(hadc))
                {
                    /* Channel sampling time configuration */
                    /* Clear the old sample time */
                    hadc->Instance->SMPR &= ~(ADC_SMPR_SMP);

