sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
                    /* Set the new sample time */
                    hadc->Instance->SMPR |= ADC_SMPR_SET(sConfig->SamplingTime);
                }
            }

            /* Management of internal measurement channels: VrefInt/TempSensor/Vbat */
            /* internal measurement paths enable: If internal channel selected,     */
            /* enable dedicated internal buffers and path.                          */
            /* Note: these internal measurement paths can be disabled using         */
            /*       HAL_ADC_DeInit() or removing the channel from sequencer with   */
            /*       channel configuration parameter "Rank".                        */
            if(ADC_IS_CHANNEL_INTERNAL(sConfig->Channel))
            {
                /* If Channel_10 is selected, enable Temp. sensor measurement path. */
                /* If Channel_11 is selected, enable VREFINT measurement path. */

                ADC->CCR |= ADC_CHANNEL_INTERNAL_PATH(sConfig->Channel);

                /* If Temp. sensor is selected, wait for stabilization delay */
                if (sConfig->Channel == ADC_CHANNEL_TEMPSENSOR)
                {
                    /* Delay for temperature sensor stabilization time */
                    /* Compute number of CPU cycles to wait for */
                    wait_loop_index = (ADC_TEMPSENSOR_DELAY_US * (SystemCoreClock / 1000000U));
                    while(wait_loop_index != 0U)
                    {
                        wait_loop_index--;
                    }
                }
            }
        }
        else
        {
            /* Regular sequence configuration */
            /* Reset the channel selection register from the selected channel */
            hadc->Instance->CHSELR &= ~ADC_CHSELR_CHANNEL(sConfig->Channel);

            /* Management of internal measurement channels: VrefInt/TempSensor/Vbat */
            /* internal measurement paths disable: If internal channel selected,    */
            /* disable dedicated internal buffers and path.                         */
            if(ADC_IS_CHANNEL_INTERNAL(sConfig->Channel))
            {
                /* If Channel_16 is selected, disable Temp. sensor measurement path. */
                /* If Channel_17 is selected, disable VREFINT measurement path. */
                /* If Channel_18 is selected, disable VBAT measurement path. */
                ADC->CCR &= ~ADC_CHANNEL_INTERNAL_PATH(sConfig->Channel);
            }
        }

    }

    /* If a conversion is on going on regular group, no update on regular       */
    /* channel could be done on neither of the channel configuration structure  */
    /* parameters.                                                              */
    else
    {
        /* Update ADC state machine to error */
        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

        tmp_hal_status = HAL_ERROR;
    }

    /* Process unlocked */
    __HAL_UNLOCK(hadc);

    /* Return function status */
    return tmp_hal_status;
}


/**
  * @brief  Configures the analog watchdog.
  * @note   Possibility to update parameters on the fly:
  *         This function initializes the selected analog watchdog, following
  *         calls to this function can be used to reconfigure some parameters
  *         of structure "ADC_AnalogWDGConfTypeDef" on the fly, without reseting
  *         the ADC.
  *         The setting of these parameters is conditioned to ADC state.
  *         For parameters constraints, see comments of structure
  *         "ADC_AnalogWDGConfTypeDef".
  * @param  hadc ADC handle
  * @param  AnalogWDGConfig Structure of ADC analog watchdog configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_AnalogWDGConfig(ADC_HandleTypeDef* hadc, ADC_AnalogWDGConfTypeDef* AnalogWDGConfig)
{
    HAL_StatusTypeDef tmp_hal_status = HAL_OK;

    uint32_t tmpAWDHighThresholdShifted;
    uint32_t tmpAWDLowThresholdShifted;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
    assert_param(IS_ADC_ANALOG_WATCHDOG_MODE(AnalogWDGConfig->WatchdogMode));
    assert_param(IS_FUNCTIONAL_STATE(AnalogWDGConfig->ITMode));

    /* Verify if threshold is within the selected ADC resolution */
    assert_param(IS_ADC_RANGE(ADC_GET_RESOLUTION(hadc), AnalogWDGConfig->HighThreshold));
    assert_param(IS_ADC_RANGE(ADC_GET_RESOLUTION(hadc), AnalogWDGConfig->LowThreshold));

    if(AnalogWDGConfig->WatchdogMode == ADC_ANALOGWATCHDOG_SINGLE_REG)
    {
        assert_param(IS_ADC_CHANNEL(AnalogWDGConfig->Channel));
    }

    /* Process locked */
    __HAL_LOCK(hadc);

    /* Parameters update conditioned to ADC state:                              */
    /* Parameters that can be updated when ADC is disabled or enabled without   */
    /* conversion on going on regular group:                                    */
    /*  - Analog watchdog channels                                              */
    /*  - Analog watchdog thresholds                                            */
    if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
    {
        /* Configuration of analog watchdog:                                      */
        /*  - Set the analog watchdog enable mode: one or overall group of        */
        /*    channels.                                                           */
        /*  - Set the Analog watchdog channel (is not used if watchdog            */
        /*    mode "all channels": ADC_CFGR_AWD1SGL=0).                           */
        hadc->Instance->CFGR1 &= ~( ADC_CFGR1_AWDSGL |
                                    ADC_CFGR1_AWDEN  |
                                    ADC_CFGR1_AWDCH   );

        hadc->Instance->CFGR1 |= ( AnalogWDGConfig->WatchdogMode            |
                                   ADC_CFGR_AWDCH(AnalogWDGConfig->Channel)  );

        /* Shift the offset in function of the selected ADC resolution: Thresholds*/
        /* have to be left-aligned on bit 11, the LSB (right bits) are set to 0   */
        tmpAWDHighThresholdShifted = ADC_AWD1THRESHOLD_SHIFT_RESOLUTION(hadc, AnalogWDGConfig->HighThreshold);
        tmpAWDLowThresholdShifted  = ADC_AWD1THRESHOLD_SHIFT_RESOLUTION(hadc, AnalogWDGConfig->LowThreshold);

        /* Set the high and low thresholds */
        hadc->Instance->TR &= ~(ADC_TR_HT | ADC_TR_LT);
        hadc->Instance->TR |=  ( ADC_TRX_HIGHTHRESHOLD (tmpAWDHighThresholdShifted) |
                                 tmpAWDLowThresholdShifted                           );

        /* Clear the ADC Analog watchdog flag (in case of left enabled by         */
        /* previous ADC operations) to be ready to use for HAL_ADC_IRQHandler()   */
        /* or HAL_ADC_PollForEvent().                                             */
        __HAL_ADC_CLEAR_FLAG(hadc, ADC_IT_AWD);

