sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
        /* Configure ADC Analog watchdog interrupt */
        if(AnalogWDGConfig->ITMode == ENABLE)
        {
            /* Enable the ADC Analog watchdog interrupt */
            __HAL_ADC_ENABLE_IT(hadc, ADC_IT_AWD);
        }
        else
        {
            /* Disable the ADC Analog watchdog interrupt */
            __HAL_ADC_DISABLE_IT(hadc, ADC_IT_AWD);
        }

    }
    /* If a conversion is on going on regular group, no update could be done    */
    /* on neither of the AWD configuration structure parameters.                */
    else
    {
        /* Update ADC state machine to error */
        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

        tmp_hal_status = HAL_ERROR;
    }


    /* Process unlocked */
    __HAL_UNLOCK(hadc);

    /* Return function status */
    return tmp_hal_status;
}


/**
  * @}
  */


/** @defgroup ADC_Exported_Functions_Group4 Peripheral State functions
 *  @brief    Peripheral State functions
 *
@verbatim
 ===============================================================================
            ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions to get in run-time the status of the
    peripheral.
      (+) Check the ADC state
      (+) Check the ADC error code

@endverbatim
  * @{
  */

/**
  * @brief  Return the ADC state
  * @note   ADC state machine is managed by bitfields, ADC status must be
  *         compared with states bits.
  *         For example:
  *           " if (HAL_IS_BIT_SET(HAL_ADC_GetState(hadc1), HAL_ADC_STATE_REG_BUSY)) "
  *           " if (HAL_IS_BIT_SET(HAL_ADC_GetState(hadc1), HAL_ADC_STATE_AWD1)    ) "
  * @param  hadc ADC handle
  * @retval HAL state
  */
uint32_t HAL_ADC_GetState(ADC_HandleTypeDef* hadc)
{
    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

    /* Return ADC state */
    return hadc->State;
}

/**
  * @brief  Return the ADC error code
  * @param  hadc ADC handle
  * @retval ADC Error Code
  */
uint32_t HAL_ADC_GetError(ADC_HandleTypeDef *hadc)
{
    return hadc->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Functions ADC Private Functions
  * @{
  */

/**
  * @brief  Enable the selected ADC.
  * @note   Prerequisite condition to use this function: ADC must be disabled
  *         and voltage regulator must be enabled (done into HAL_ADC_Init()).
  * @note   If low power mode AutoPowerOff is enabled, power-on/off phases are
  *         performed automatically by hardware.
  *         In this mode, this function is useless and must not be called because
  *         flag ADC_FLAG_RDY is not usable.
  *         Therefore, this function must be called under condition of
  *         "if (hadc->Init.LowPowerAutoPowerOff != ENABLE)".
  * @param  hadc ADC handle
  * @retval HAL status.
  */
static HAL_StatusTypeDef ADC_Enable(ADC_HandleTypeDef* hadc)
{
//  uint32_t tickstart = 0U;
    __IO uint32_t wait_loop_index = 0U;

    /* ADC enable and wait for ADC ready (in case of ADC is disabled or         */
    /* enabling phase not yet completed: flag ADC ready not yet set).           */
    /* Timeout implemented to not be stuck if ADC cannot be enabled (possible   */
    /* causes: ADC clock not running, ...).                                     */
    if (ADC_IS_ENABLE(hadc) == RESET)
    {
        /* Check if conditions to enable the ADC are fulfilled */
        if (ADC_ENABLING_CONDITIONS(hadc) == RESET)
        {
            /* Update ADC state machine to error */
            SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

            /* Set ADC error code to ADC IP internal error */
            SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);

            return HAL_ERROR;
        }

        /* Enable the ADC peripheral */
        __HAL_ADC_ENABLE(hadc);

        /* Delay for ADC stabilization time */
        /* Compute number of CPU cycles to wait for */
        wait_loop_index = (ADC_STAB_DELAY_US * (SystemCoreClock / 1000000U));
        while(wait_loop_index != 0U)
        {
            wait_loop_index--;
        }

        /* Get tick count */
//    tickstart = HAL_GetTick();

        /* Wait for ADC effectively enabled */
//    while(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_RDY) == RESET)
//    {
//      if((HAL_GetTick() - tickstart) > ADC_ENABLE_TIMEOUT)
//      {
//        /* Update ADC state machine to error */
//        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);
//
//        /* Set ADC error code to ADC IP internal error */
//        SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);
//
//        return HAL_ERROR;
//      }
//    }

    }

    /* Return HAL status */
    return HAL_OK;
}

/**
  * @brief  Disable the selected ADC.
  * @note   Prerequisite condition to use this function: ADC conversions must be
  *         stopped.
  * @param  hadc ADC handle
  * @retval HAL status.
  */
static HAL_StatusTypeDef ADC_Disable(ADC_HandleTypeDef* hadc)
{
    uint32_t tickstart = 0U;

    /* Verification if ADC is not already disabled:                             */
    /* Note: forbidden to disable ADC (set bit ADC_CR_ADDIS) if ADC is already  */
    /*       disabled.                                                          */
    if (ADC_IS_ENABLE(hadc) != RESET)
    {
        /* Check if conditions to disable the ADC are fulfilled */
        if (ADC_DISABLING_CONDITIONS(hadc) != RESET)
        {
            /* Disable the ADC peripheral */
            __HAL_ADC_DISABLE(hadc);
        }
        else
        {
            /* Update ADC state machine to error */
            SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

            /* Set ADC error code to ADC IP internal error */
            SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);

            return HAL_ERROR;
        }

        /* Wait for ADC effectively disabled */
        /* Get tick count */
        tickstart = HAL_GetTick();

        while(HAL_IS_BIT_SET(hadc->Instance->CR, ADC_CR_ADEN))
        {
            if((HAL_GetTick() - tickstart) > ADC_DISABLE_TIMEOUT)
            {
                /* Update ADC state machine to error */
                SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

                /* Set ADC error code to ADC IP internal error */
                SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);

                return HAL_ERROR;
            }
        }
    }

    /* Return HAL status */
    return HAL_OK;
}


/**
  * @brief  Stop ADC conversion.
  * @note   Prerequisite condition to use this function: ADC conversions must be
  *         stopped to disable the ADC.
  * @param  hadc ADC handle
  * @retval HAL status.
  */
static HAL_StatusTypeDef ADC_ConversionStop(ADC_HandleTypeDef* hadc)
{
    uint32_t tickstart = 0U;

    /* Check the parameters */
    assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

