sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_adc.c
    /* Verification if ADC is not already stopped on regular group to bypass    */
    /* this function if not needed.                                             */
    if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc))
    {

        /* Stop potential conversion on going on regular group */
        /* Software is allowed to set ADSTP only when ADSTART=1 and ADDIS=0 */
        if (HAL_IS_BIT_SET(hadc->Instance->CR, ADC_CR_ADSTART) &&
                HAL_IS_BIT_SET(hadc->Instance->CR, ADC_CR_ADEN)                  )
//        HAL_IS_BIT_CLR(hadc->Instance->CR, ADC_CR_ADDIS)                  )
        {
            /* Stop conversions on regular group */
            hadc->Instance->CR |= ADC_CR_ADSTP;
        }

        /* Wait for conversion effectively stopped */
        /* Get tick count */
        tickstart = HAL_GetTick();

        while((hadc->Instance->CR & ADC_CR_ADSTART) != RESET)
        {
            if((HAL_GetTick() - tickstart) > ADC_STOP_CONVERSION_TIMEOUT)
            {
                /* Update ADC state machine to error */
                SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

                /* Set ADC error code to ADC IP internal error */
                SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);

                return HAL_ERROR;
            }
        }

    }

    /* Return HAL status */
    return HAL_OK;
}


/**
  * @brief  DMA transfer complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void ADC_DMAConvCplt(DMA_HandleTypeDef *hdma)
{
    /* Retrieve ADC handle corresponding to current DMA handle */
    ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

    /* Update state machine on conversion status if not in error state */
    if (HAL_IS_BIT_CLR(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL | HAL_ADC_STATE_ERROR_DMA))
    {
        /* Set ADC state */
        SET_BIT(hadc->State, HAL_ADC_STATE_REG_EOC);

        /* Determine whether any further conversion upcoming on group regular     */
        /* by external trigger, continuous mode or scan sequence on going.        */
        if(ADC_IS_SOFTWARE_START_REGULAR(hadc)        &&
                (hadc->Init.ContinuousConvMode == DISABLE)   )
        {
            /* If End of Sequence is reached, disable interrupts */
            if( __HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOS) )
            {
                /* Allowed to modify bits ADC_IT_EOC/ADC_IT_EOS only if bit           */
                /* ADSTART==0 (no conversion on going)                                */
                if (ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
                {
                    /* Disable ADC end of single conversion interrupt on group regular */
                    /* Note: Overrun interrupt was enabled with EOC interrupt in        */
                    /* HAL_Start_IT(), but is not disabled here because can be used     */
                    /* by overrun IRQ process below.                                    */
                    __HAL_ADC_DISABLE_IT(hadc, ADC_IT_EOC | ADC_IT_EOS);

                    /* Set ADC state */
                    ADC_STATE_CLR_SET(hadc->State,
                                      HAL_ADC_STATE_REG_BUSY,
                                      HAL_ADC_STATE_READY);
                }
                else
                {
                    /* Change ADC state to error state */
                    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

                    /* Set ADC error code to ADC IP internal error */
                    SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);
                }
            }
        }

        /* Conversion complete callback */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
        hadc->ConvCpltCallback(hadc);
#else
        HAL_ADC_ConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
    }
    else
    {
        /* Call DMA error callback */
        hadc->DMA_Handle->XferErrorCallback(hdma);
    }

}

/**
  * @brief  DMA half transfer complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void ADC_DMAHalfConvCplt(DMA_HandleTypeDef *hdma)
{
    /* Retrieve ADC handle corresponding to current DMA handle */
    ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

    /* Half conversion callback */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->ConvHalfCpltCallback(hadc);
#else
    HAL_ADC_ConvHalfCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA error callback
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void ADC_DMAError(DMA_HandleTypeDef *hdma)
{
    /* Retrieve ADC handle corresponding to current DMA handle */
    ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

    /* Set ADC state */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_DMA);

    /* Set ADC error code to DMA error */
    SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_DMA);

    /* Error callback */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->ErrorCallback(hadc);
#else
    HAL_ADC_ErrorCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}

/**
  * @}
  */

#endif /* HAL_ADC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya Semiconductor *****END OF FILE****/
